# 置文件为空
cat /dev/null > $log


# Linux od命令用于输出文件内容。
# od指令会读取所给予的文件的内容，并将其内容以八进制字码呈现出来。


# 语法
od [-abcdfhilovx][-A <字码基数>][-j <字符数目>][-N <字符数目>][-s <字符串字符数>][-t <输出格式>][-w <每列字符数>][--help][--version][文件...]
# 参数：

-a #  　此参数的效果和同时指定"-ta"参数相同。
-A # <字码基数> 　选择要以何种基数计算字码。
-b #  　此参数的效果和同时指定"-toC"参数相同。
-c #  　此参数的效果和同时指定"-tC"参数相同。
-d #  　此参数的效果和同时指定"-tu2"参数相同。
-f #  　此参数的效果和同时指定"-tfF"参数相同。
-h #  　此参数的效果和同时指定"-tx2"参数相同。
-i #  　此参数的效果和同时指定"-td2"参数相同。
-j # <字符数目>或--skip-bytes=<字符数目> 　略过设置的字符数目。
-l #  　此参数的效果和同时指定"-td4"参数相同。
-N # <字符数目>或--read-bytes=<字符数目> 　到设置的字符数目为止。
-o #  　此参数的效果和同时指定"-to2"参数相同。
-s # <字符串字符数>或--strings=<字符串字符数> 　只显示符合指定的字符数目的字符串。
-t # <输出格式>或--format=<输出格式> 　设置输出格式。
-v # 或--output-duplicates 　输出时不省略重复的数据。
-w # <每列字符数>或--width=<每列字符数> 　设置每列的最大字符数。
-x #  　此参数的效果和同时指定"-h"参数相同。
--help # 　在线帮助。
--version # 　显示版本信息。


### 实例
# 创建 tmp 文件：
echo abcdef g > tmp
cat tmp
#> abcdef g

od -b tmp
#> 0000000 141 142 143 144 145 146 040 147 012
#> 0000011

# 使用单字节八进制解释进行输出，注意左侧的默认地址格式为八字节:
od -c tmp
#> 0000000   a   b   c   d   e   f       g  \n
#> 0000011

# 使用ASCII码进行输出，注意其中包括转义字符
od -t d1 tmp
#> 0000000   97   98   99  100  101  102   32  103   10
#> 0000011

# 使用单字节十进制进行解释
od -A d -c tmp
#> 0000000   a   b   c   d   e   f       g  \n
#> 0000009
