#!/usr/bin/env bash

chmod -R 777 ${PWD}
sudo chown -R oudream ${PWD} ; chgrp -R oudream ${PWD}

### chown chmod 权限

# drwxrwxrwx 是10个空间保持值。你可以忽略第一个，然后有 3组 3。第一集为所有者，第二个集为该组，最后一集为世界。
# 第一个字符表示文件类型。
# - 表示该文件是一个普通文件
# d 表示该文件是一个目录，字母"d"，是dirtectory(目录)的缩写。注意：目录或者是特殊文件，这个特殊文件存放其他文件或目录的相关信息
# l 表示该文件是一个链接文件。字母"l"是link(链接)的缩写，类似于windows下的快捷方式
# b 的表示块设备文件(block)，一般置于/dev目录下，设备文件是普通文件和程序访问硬件设备的入口，是很特殊的文件。没有文件大小，只有一个主设备号和一个辅设备号。一次传输数据为一整块的被称为块设备，如硬盘、光盘等。最小数据传输单位为一个数据块(通常一个数据块的大小为512字节)
# c 表示该文件是一个字符设备文件(character)，一般置于/dev目录下，一次传输一个字节的设备被称为字符设备，如键盘、字符终端等，传输数据的最小单位为一个字节
# p 表示该文件为命令管道文件。与shell编程有关的文件
# s 表示该文件为sock文件。与shell编程有关的文件
# r 表是读 (Read) 、w表示写(Write) 、x表示执行 (eXecute)

chmod [class] [operator] [permission] 文件
chmod ［who］ ［+ | - | =］ ［mode］ 文件名
chmod [ugoa] [+ or -] [rwx] 文件
# 权限范围：u ：目录或者文件的当前的用户；g ：目录或者文件的当前的群组；
#    o ：除了目录或者文件的当前用户或群组之外的用户或者群组；a ：所有的用户及群组
# 权限代号：r ：读权限，用数字4表示；w ：写权限，用数字2表示；x ：执行权限，用数字1表示
#    - ：删除权限，用数字0表示；s ：特殊权限；r=4，w=2，x=1; 若要rw-属性则4+2=6；
chmod u+x，g-w，o todo.txt

chown [选项] 用户或组 文件
# -R 递归式地改变指定目录及其下的所有子目录和文件的属组。
chgrp [选项] group filename?
# -R 递归式地改变指定目录及其下的所有子目录和文件的属组。

