#!/usr/bin/env bash

stat [option] file

-L：显示符号链接所指向文件的信息
-f：显示文件所在文件系统的信息
-t：以简洁方式输出信息
-c：以特定格式输出文件的某些信息

%a     八进制表示的访问权限
%A     可读格式表示的访问权限
%b     分配的块数（参见 %B）
%B     %b 参数显示的每个块的字节数
%d     十进制表示的设备号
%D     十六进制表示的设备号
%f     十六进制表示的 Raw 模式
%F     文件类型
%g     属主的组 ID
%G     属主的组名
%h     硬连接数
%i     Inode 号
%n     文件名
%N     如果是符号链接，显示器所链接的文件名
%o     I/O 块大小
%s     全部占用的字节大小
%t     十六进制的主设备号
%T     十六进制的副设备号
%u     属主的用户 ID
%U     属主的用户名
%x     最后访问时间
%X     最后访问时间，自 Epoch 开始的秒数
%y     最后修改时间
%Y     最后修改时间，自 Epoch 开始的秒数
%z     最后改变时间
%Z     最后改变时间，自 Epoch 开始的秒数

针对文件系统还有如下格式选项：

%a     普通用户可用的块数
%b     文件系统的全部数据块数
%c     文件系统的全部文件节点数
%d     文件系统的可用文件节点数
%f     文件系统的可用节点数
%C     SELinux 的安全上下文
%i     十六进制表示的文件系统 ID
%l     文件名的最大长度
%n     文件系统的文件名
%s     块大小（用于更快的传输）
%S     基本块大小（用于块计数）
%t     十六进制表示的文件系统类型
%T     可读格式表示的文件系统类型


Access time（atime）：表示我们最后一次访问（仅仅是访问，没有改动）文件的时间。读一次这个文件的内容，这个时间就会更新，比如对这个文件运用 grep、sed、more、cat 、less、tail、head等命令，ls、stat命令都不会修改文件的访问时间。
Modify time（mtime）：表示我们最后一次修改文件的时间。比如：vim后保存文件。ls -l列出的时间就是这个时间。
Change time（ctime）：表示我们最后一次对文件属性改变的时间，包括权限，大小，属性等等。如使用chmod，chown，mv，ln，就会改变文件的Change time。

#
stat /etc/passwd -c %Y
stat /etc/passwd -c %y