
# save htop output to file
# https://archlinux.pkgs.org/rolling/archlinux-community-aarch64/
echo q | htop -p 788 | aha --black --line-fix > htop`date +"%Y-%m-%d-%H-%M-%S"`.html


工作站系统
光源与检测器
2D图像（测量、处理、AI、检测）
3D图像（展示、重建、检测）
运控界面
图像导航
插件工具（探针、拼接）


运控系统
设备管理（轴、光源、检测器
变量管理（实时、计算、数据库、接口）
视觉（采图、读图、发图）
坐标管理（变换、移动、差异）
通信（通道、协议、点表）
运控编制（条件、迭代、接口、变量、参数、定时）
安全管理（保障运控能够安全运行，保障机台不撞机）
HMI定制（大屏）
运控执行
HMI运行


业务系统
用户管理（人员、权限）
设备管理（固化配置：光源、检测器、保养）
系统配置
日志
操作记录
报表（工单、检测结果）
实时监控
警报


一个基础平台
守护监控（包括日志管理）
消息线（实时线、历史线）
文件存储（包括读写）
数据库（单机、服务版）
安全服务（数据加密、加密狗）


