#!/usr/bin/env bash

# Linux下配置网卡ip别名何谓ip别名？
# 用windows的话说，就是为一个网卡配置多个ip。
# 什么场合增加ip别名能派上用场？
# 布网需要、多ip访问测试、特定软件对多ip的需要...and so on.


# 为服务器网卡配置静态ip地址
ifconfig eth0 192.168.6.99 netmask 255.255.255.0 up
# eth0                     //机器的第一个网卡，有些机器有多个网卡，eth1、eth2...
# 192.168.6.99                       //设置网卡的静态ip地址
# netmask 255.255.255.0   //ip地址的子网掩码，无需多解释
# up                          //表示立即激活该网卡


# 设置网卡的ip别名 ### 当系统重启后，所有的ip别名都会丢失
ifconfig eth0:0 192.168.6.100 netmask 255.255.255.0 up
ifconfig eth0:1 173.173.173.173 netmask 255.255.255.0 up
ifconfig eth0:2 119.110.120.1 netmask 255.255.255.0 up
# 清除ip别名
ifconfg eth0:0 down
ifconfg eth0:1 down
ifconfg eth0:2 down

# eth0:x                    //虚拟网络接口，建立在eth0上，取值范围0-255
# 192.168.6.xxx      //增加ip别名，想加多少就加多少～～

# ＊注意：在设置ip别名时，如果增加的是和局域网同一网段的ip（如192.168.6.100），
# 那么除了本机外局域网内其他机器都可以ping通这个ip。如果增加的是奇形怪状的ip，那么就只有本机可以ping通而已，
# 后者主要用于本机测试需要。


# 保留网卡的ip别名信息
# 1.将增加ip别名的命令填写到/etc/rc.local文件中
# 即将所有如这样ifconfig eth0:0 192.168.6.100 netmask 255.255.255.0 up
# 的命令一行行全部填写到rc.local文件中去，rc.local文件是作用于linux开机自动执行命令，
# 详细用法g或b一下，这里不详细说明。
# 这个方法最方便，但不太可靠，有时会失灵。


# 手动编写ip别名的网卡配置文件
# 所有网卡的配置文件都保存在/etc/sysconfig/network-scripts目录中，一个网卡对应一个配置文件，如图：
# 文件ifcfg-eth0就是本机网卡的配置文件，我们可以通过仿照这个文件的格式来编写其他ip别名的配置文件。
vi ifcfg-eth0
# 打开网卡的配置文件，将里面所有字段复制一下
vi ifcfg-eth0:0 # 创建新 IP
# 创建eth0:0的配置文件，并将刚才复制的字段粘贴到这个配置文件，按照下文的介绍修改部分信息，修改完成后保存退出

# 以下是网卡配置文件的部分信息说明，其他类似信息默认即可：
# ##############################################################################
# 3Com Corporation 3c905B 100BaseTX [Cyclone]    //硬件型号，忽略不计
# DEVICE=eth0:0                 //虚拟网络接口，随意
# ONBOOT=yes                    //系统启动时激活
# BOOTPROTO=static             //使用静态ip地址
# IPADDR=192.168.6.100          //该虚拟网络接口的ip别名，随意
# NETMASK=255.255.255.0         //子网掩码，对应ip别名
# GATEWAY=192.168.6.1           //网关，对应ip别名
# HWADDR=00:10:5A:5E:B1:E4      //网卡MAC地址，无需更改
# USERCTL=no                    //是否给予非root用户设备管理权限
# ##############################################################################

# 这个方法最繁琐，但又是最可靠，唉，人生就是这样，永远不得两全其美～～

